let spanID = document.querySelector(".dagen");
let datum = new Date();
let dagen = datum.getDay();

let veckodagar = ["Söndag", "Måndag", "Tisdag", "Onsdag", "Torsdag", "Fredag", "Lördag"];
let veckodag = veckodagar[dagen];

  spanID.innerText = `"${veckodag}"`;


  let dgr = dagen
  let DuaSpan = document.querySelector(".DuaSpan")
  let DuaRubrik = document.querySelector(".DuaRubrik")
  if(dgr == 1){
    DuaRubrik.innerText = `${veckodagar[dgr]} dua'a `

    DuaSpan.innerText = `1 أَلْحَمْدُ لِلَّهِ الَّذِي لَمْ يُشْهِدْ أَحَدَاً حِينَ فَطَرَ السَّمواتِ وَالاَرْضَ، وَلاَ اتَّخَذَ مُعِيناً حِينَ بَرَأَ النَّسَماتِ. 2 ـ لَمْ يُشارَكْ فِي الالهِيَّةِ، وَلَمْ يُظَاهَرْ فِي الْوَحْدانِيَّةِ. 3 ـ كَلَّتِ الاَلْسُنُ عَنْ غايَةِ صِفَتِهِ، وَ انحسرت الْعُقُولُ عَنْ كُنْهِ مَعْرِفَتِهِ، وَتَوَاضَعَتِ الْجَبابِرَةُ لِهَيْبَتِهِ، وَعَنَتِ الْوُجُوهُ لِخَشْيَتِهِ، وَانْقَادَ كُلُّ عَظِيم لِعَظَمَتِهِ. 4 ـ فَلَكَ الْحَمْدُ مُتَوَاتِراً مُتَّسِقاً، وَمُتَوَالِياً مُسْتَوْسِقَاً.5 ـ وَصَلَواتُهُ عَلَى رَسُولِهِ أَبَدَاً، وَسَلامُهُ دَآئِماً سَرْمَدَاً. 6 ـ أَللَّهُمَّ اجْعَلْ أَوَّلَ يَوْمِي هذَا صَلاحَاً، وَأَوْسَطَهُ فَلاحَاً، وَآخِرَهُ نَجاحَاً، وَأَعُوذُ بِكَ مِنْ يَوْم أَوَّلُهُ فَزَعُ، وَأَوْسَطُهُ جَزَعٌ، وَآخِرُهُ وَجَعٌ. 7 ـ أَللَّهُمَّ إنِّي أَسْتَغْفِرُكَ لِكُلِّ نَذْر نَذَرْتُهُ، وَلِكُلِّ وَعْد وَعَدْتُهُ، وَلِكُلِّ عَهْد عاهَدْتُهُ، ثُمَّ لَمْ أَفِ لَكَ بِهِ. 8 ـ وَأَسْأَلُكَ فِي مَظالِمِ عِبادِكَ عِنْدِي، فَأَيُّما عَبْد مِنْ عَبِيدِكَ، أَوْ أَمَة مِنْ إمآئِكَ، كَانَتْ لَهُ قِبَلِي مَظْلَمَةٌ ظَلَمْتُها إيَّاهُ فِي نَفْسِهِ، أَوْ فِي عِرْضِهِ، أَوْ فِي مالِهِ، أَوْ فِي أَهْلِهِ وَوَلَدِهِ، أَوْ غَيْبَةٌ اغْتَبْتَهُ بِها، أَوْ تَحامُلٌ عَلَيْهِ بِمَيْل أَوْ هَوَىً، أَوْ أَنَفَة، أَوْ حَمِيَّة، أَوْ رِيآء، أَوْ عَصَبِيَّة غائِباً كانَ أَوْ شاهِداً، وَحَيّاً كانَ أَوْ مَيِّتاً، فَقَصُرَتْ يَدِي، وَضاقَ وُسْعِي عَنْ رَدِّها إلَيْهِ، وَالتَّحَلُّلِ مِنْهُ. 9 ـ فَأَسْأَلُكَ يا مَنْ يَمْلِكُ الْحاجاتِ، وَهِيَ مُسْتَجِيبَةٌ بِمَشِيَّتِهِ ، وَمُسْرِعَةٌ إلى إرادَتِهِ، أَنْ تُصَلِّيَ عَلَى مُحَمَّد وَآلِ مُحَمَّد ، وَأَنْ تُرْضِيَهُ عَنِّي بِما شِئْتَ، وَتَهَبَ لِي مِنْ عِنْدِكَ رَحْمَةً، إنَّهُ لا تَنْقُصُكَ الْمَغْفِرَةُ، وَلا تَضُرُّكَ المَوْهِبَةُ يا أَرْحَمَ الرَّاحِمِينَ. 10 ـ أَللَّهُمَّ أَوْلِنِي فِي كُلِّ يَوْمِ اثْنَيْنِ نِعْمَتَيْنِ مِنْكَ ثِنْتَيْنِ: سَعادَةً فِي أَوَّلِهِ بِطاعَتِكَ، وَنِعْمَةً فِي آخِرِهِ بِمَغْفِرَتِكَ يامَنْ هُوَ الاِلهُ، وَلا يَغْفِرُ الذُّنُوبَ سِواهُ. 
    
    `
  }
  else if(dgr == 2){
    DuaRubrik.innerText = `${veckodagar[dgr]} dua'a `

    DuaSpan.innerText = `أَلْحَمْدُ للّهِ وَالْحَمْدُ حَقُّهُ كَما يَسْتَحِقُّهُ حَمْداً كَثِيرا وَأَعُوذُ بِهِ مِنْ شَرِّ نَفْسِي، إنَّ النَّفْسَ لاَمَّارَةٌ بِالسُّوءِ إلاَّ ما رَحِمَ رَبِّي. وَأَعُوذُ بِهِ مِنْ شَرِّ الشَّيْطَانِ الَّذِي يَزِيدُنِي ذَنْباً إلَى ذَنْبِي.وَأَحْتَرِزُ بِهِ مِنْ كُلِّ جَبَّار فاجِر، وَسُلْطان جآئر، وَعَدُوٍّ قاهِر. أَللَّهُمَّ اجْعَلْنِي مِنْ جُنْدِكَ فَإنَّ جُنْدَكَ هُمُ الْغالِبُونَ، وَاجْعَلْنِي مِنْ حِزْبِكَ; فَإنَّ حِزْبَكَ هُمُ الْمُفْلِحُونَ، وَاجْعَلْنِي مِنْ أَوْلِيآئِكَ; فَإنَّ أَوْلِيَاءَكَ لا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ. أَللَّهُمَّ أَصْلِحْ لِي دِيْنِي فَإنَّهُ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي آخِرَتِي فَإنَّهَا دارُ مَقَرِّي، وَإلَيْها مِنْ مُجاوَرَةِ اللِّئامِ مَفَرِّي، وَاجْعَلِ الْحَياةَ زِيادَةً لِي فِي كُلِّ خَيْر، وَالْوَفاةَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ.أَللَّهُمَّ صَلِّ عَلَى مُحَمَّد خاتَمِ النَّبِيِّينَ وَتَمَامِ عِدَّةِ الْمُرْسَلِينَ وَعَلَى آلِهِ الطَّيِّبِينَ الطَّاهِرِينَ، وَأَصْحَابِهِ الْمُنْتَجَبِينَ وَهَبْ لِي فِي الثُلُثآءِ ثَلاثاً: لا تَدَعْ لِي ذَنْباً إلاَّ غَفَرْتَهُ، وَلا غَمّاً إلاَّ أَذْهَبْتَهُ، وَلا عَدُوّاً إلاَّ دَفَعْتَهُ. بِبِسْمِ اللهِ خَيْرِ الاَسْمآءِ، بِسْمِ اللهِ رَبِّ الاَرْضِ وَالسَّمآءِ أَسْتَدْفِعُ كُلَّ مَكْرُوه أَوَّلُهُ سَخَطُهُ، وَأَسْتَجْلِبُ كُلَّ مَحْبُوب أَوَّلُهُ رِضاهُ. فَاخْتِمْ لِي مِنْكَ بِالْغُفْرانِ يا وَلِيَّ الاِحْسانِ. 
    
    `
  }