let spanID = document.querySelector(".dagen");
let datum = new Date();
let dagen = datum.getDay();

let veckodagar = ["Söndag", "Måndag", "Tisdag", "Onsdag", "Torsdag", "Fredag", "Lördag"];
let veckodag = veckodagar[dagen];

  spanID.innerText = `"${veckodag}"`;


  let dgr = dagen
  let DuaSpan = document.querySelector(".DuaSpan")
  let DuaRubrik = document.querySelector(".DuaRubrik")
  if(dgr == 1){
    DuaRubrik.innerText = `${veckodagar[dgr]} dua'a `

    DuaSpan.innerText = `1 أَلْحَمْدُ لِلَّهِ الَّذِي لَمْ يُشْهِدْ أَحَدَاً حِينَ فَطَرَ السَّمواتِ وَالاَرْضَ، وَلاَ اتَّخَذَ مُعِيناً حِينَ بَرَأَ النَّسَماتِ. 2 ـ لَمْ يُشارَكْ فِي الالهِيَّةِ، وَلَمْ يُظَاهَرْ فِي الْوَحْدانِيَّةِ. 3 ـ كَلَّتِ الاَلْسُنُ عَنْ غايَةِ صِفَتِهِ، وَ انحسرت الْعُقُولُ عَنْ كُنْهِ مَعْرِفَتِهِ، وَتَوَاضَعَتِ الْجَبابِرَةُ لِهَيْبَتِهِ، وَعَنَتِ الْوُجُوهُ لِخَشْيَتِهِ، وَانْقَادَ كُلُّ عَظِيم لِعَظَمَتِهِ. 4 ـ فَلَكَ الْحَمْدُ مُتَوَاتِراً مُتَّسِقاً، وَمُتَوَالِياً مُسْتَوْسِقَاً.5 ـ وَصَلَواتُهُ عَلَى رَسُولِهِ أَبَدَاً، وَسَلامُهُ دَآئِماً سَرْمَدَاً. 6 ـ أَللَّهُمَّ اجْعَلْ أَوَّلَ يَوْمِي هذَا صَلاحَاً، وَأَوْسَطَهُ فَلاحَاً، وَآخِرَهُ نَجاحَاً، وَأَعُوذُ بِكَ مِنْ يَوْم أَوَّلُهُ فَزَعُ، وَأَوْسَطُهُ جَزَعٌ، وَآخِرُهُ وَجَعٌ. 7 ـ أَللَّهُمَّ إنِّي أَسْتَغْفِرُكَ لِكُلِّ نَذْر نَذَرْتُهُ، وَلِكُلِّ وَعْد وَعَدْتُهُ، وَلِكُلِّ عَهْد عاهَدْتُهُ، ثُمَّ لَمْ أَفِ لَكَ بِهِ. 8 ـ وَأَسْأَلُكَ فِي مَظالِمِ عِبادِكَ عِنْدِي، فَأَيُّما عَبْد مِنْ عَبِيدِكَ، أَوْ أَمَة مِنْ إمآئِكَ، كَانَتْ لَهُ قِبَلِي مَظْلَمَةٌ ظَلَمْتُها إيَّاهُ فِي نَفْسِهِ، أَوْ فِي عِرْضِهِ، أَوْ فِي مالِهِ، أَوْ فِي أَهْلِهِ وَوَلَدِهِ، أَوْ غَيْبَةٌ اغْتَبْتَهُ بِها، أَوْ تَحامُلٌ عَلَيْهِ بِمَيْل أَوْ هَوَىً، أَوْ أَنَفَة، أَوْ حَمِيَّة، أَوْ رِيآء، أَوْ عَصَبِيَّة غائِباً كانَ أَوْ شاهِداً، وَحَيّاً كانَ أَوْ مَيِّتاً، فَقَصُرَتْ يَدِي، وَضاقَ وُسْعِي عَنْ رَدِّها إلَيْهِ، وَالتَّحَلُّلِ مِنْهُ. 9 ـ فَأَسْأَلُكَ يا مَنْ يَمْلِكُ الْحاجاتِ، وَهِيَ مُسْتَجِيبَةٌ بِمَشِيَّتِهِ ، وَمُسْرِعَةٌ إلى إرادَتِهِ، أَنْ تُصَلِّيَ عَلَى مُحَمَّد وَآلِ مُحَمَّد ، وَأَنْ تُرْضِيَهُ عَنِّي بِما شِئْتَ، وَتَهَبَ لِي مِنْ عِنْدِكَ رَحْمَةً، إنَّهُ لا تَنْقُصُكَ الْمَغْفِرَةُ، وَلا تَضُرُّكَ المَوْهِبَةُ يا أَرْحَمَ الرَّاحِمِينَ. 10 ـ أَللَّهُمَّ أَوْلِنِي فِي كُلِّ يَوْمِ اثْنَيْنِ نِعْمَتَيْنِ مِنْكَ ثِنْتَيْنِ: سَعادَةً فِي أَوَّلِهِ بِطاعَتِكَ، وَنِعْمَةً فِي آخِرِهِ بِمَغْفِرَتِكَ يامَنْ هُوَ الاِلهُ، وَلا يَغْفِرُ الذُّنُوبَ سِواهُ. 
    
    `
  }
  else if(dgr == 2){
    DuaRubrik.innerText = `${veckodagar[dgr]} dua'a `

    DuaSpan.innerText = `أَلْحَمْدُ للّهِ وَالْحَمْدُ حَقُّهُ كَما يَسْتَحِقُّهُ حَمْداً كَثِيرا وَأَعُوذُ بِهِ مِنْ شَرِّ نَفْسِي، إنَّ النَّفْسَ لاَمَّارَةٌ بِالسُّوءِ إلاَّ ما رَحِمَ رَبِّي. وَأَعُوذُ بِهِ مِنْ شَرِّ الشَّيْطَانِ الَّذِي يَزِيدُنِي ذَنْباً إلَى ذَنْبِي.وَأَحْتَرِزُ بِهِ مِنْ كُلِّ جَبَّار فاجِر، وَسُلْطان جآئر، وَعَدُوٍّ قاهِر. أَللَّهُمَّ اجْعَلْنِي مِنْ جُنْدِكَ فَإنَّ جُنْدَكَ هُمُ الْغالِبُونَ، وَاجْعَلْنِي مِنْ حِزْبِكَ; فَإنَّ حِزْبَكَ هُمُ الْمُفْلِحُونَ، وَاجْعَلْنِي مِنْ أَوْلِيآئِكَ; فَإنَّ أَوْلِيَاءَكَ لا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ. أَللَّهُمَّ أَصْلِحْ لِي دِيْنِي فَإنَّهُ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي آخِرَتِي فَإنَّهَا دارُ مَقَرِّي، وَإلَيْها مِنْ مُجاوَرَةِ اللِّئامِ مَفَرِّي، وَاجْعَلِ الْحَياةَ زِيادَةً لِي فِي كُلِّ خَيْر، وَالْوَفاةَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ.أَللَّهُمَّ صَلِّ عَلَى مُحَمَّد خاتَمِ النَّبِيِّينَ وَتَمَامِ عِدَّةِ الْمُرْسَلِينَ وَعَلَى آلِهِ الطَّيِّبِينَ الطَّاهِرِينَ، وَأَصْحَابِهِ الْمُنْتَجَبِينَ وَهَبْ لِي فِي الثُلُثآءِ ثَلاثاً: لا تَدَعْ لِي ذَنْباً إلاَّ غَفَرْتَهُ، وَلا غَمّاً إلاَّ أَذْهَبْتَهُ، وَلا عَدُوّاً إلاَّ دَفَعْتَهُ. بِبِسْمِ اللهِ خَيْرِ الاَسْمآءِ، بِسْمِ اللهِ رَبِّ الاَرْضِ وَالسَّمآءِ أَسْتَدْفِعُ كُلَّ مَكْرُوه أَوَّلُهُ سَخَطُهُ، وَأَسْتَجْلِبُ كُلَّ مَحْبُوب أَوَّلُهُ رِضاهُ. فَاخْتِمْ لِي مِنْكَ بِالْغُفْرانِ يا وَلِيَّ الاِحْسانِ. 
    
    `
  }
   else if(dgr == 3){
    DuaRubrik.innerText = `${veckodagar[dgr]} dua'a `

    DuaSpan.innerText = `أَلْحَمْدُ لِلّهِ الَّذِي جَعَلَ اللَّيْلَ لِباساً، وَالنَّوْمَ سُباتَاً، وَجَعَلَ النَّهارَ نُشُوراً. لَكَ الْحَمْدُ أَنْ بَعَثْتَنِي مِنْ مَرْقَدِي، وَلَوْ شِئْتَ جَعَلْتَهُ سَرْمَداً حَمْداً دَائِمَاً لا يَنْقَطِعُ أَبَداً، وَلا يُحْصِي لَهُ الْخَلائِقُ عَدَدَاً.أَللَّهُمَّ لَكَ الْحَمْدُ أَنْ خَلَقْتَ فَسَوَّيْتَ، وَقَدَّرْتَ وَقَضَيْتَ، وَأَمَتَّ وَأَحْيَيْتَ، وَأَمْرَضْتَ وَشَفَيْتَ، وَعافَيْتَ وَأَبْلَيْتَ، وَعَلَى الْعَرْشِ اسْتَوَيْتَ، وَعَلَى الْمُلْكِ احْتَوَيْتَ. أَدْعُوكَ دُعآءَ مَنْ ضَعُفَتْ وَسِيلَتُهُ، وَانْقَطَعَتْ حِيلَتُهُ، وَاقْتَرَبَ أَجَلُهُ، وَتَدانى فِي الدُّنْيا أَمَلُهُ، وَاشْتَدَّتْ إلى رَحْمَتِكَ فاقَتُهُ، وَعَظُمَتْ لِتَفْرِيطِهِ حَسْرَتُهُ، وَكَثُرَتْ زَلَّتُهُ وَعَثْرَتُهُ، وَخَلُصَتْ لِوَجْهِكَ تَوْبَتُهُ.فَصَلِّ عَلى مُحَمَّد خاتَمِ النَّبِيِّينَ، وَعَلى أَهْلِ بَيْتِهِ الطَّيِّبِينَ الطَّاهِرِينَ، وَارْزُقْنِي شَفاعَةَ مُحَمَّد صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ، وَلا تَحْرِمْنِي صُحْبَتَهُ إنَّكَ أَنْتَ أَرْحَمُ الرَّاحِمِينَ. أَللَّهُمَّ اقْضِ لِي فِي الاَرْبِعآءِ أَرْبَعَاً: إجْعَلْ قُوَّتِي فِي طاعَتِكَ، وَنَشاطِي فِي عِبادَتِكَ، وَرَغْبَتِي فِي ثَوَابِكَ، وَزُهْدِي فِيما يُوجِبُ لِي أَلِيمَ عِقابِكَ، إنَّكَ لَطِيفٌ لِما تَشآءُ. 
    
    `
  }
   else if(dgr == 4){
    DuaRubrik.innerText = `${veckodagar[dgr]} dua'a `

    DuaSpan.innerText = `أَلْحَمْدُ لِلّهِ الَّذِي أَذْهَبَ اللَّيْلَ مُظْلِمَاً بِقُدْرَتِهِ، وَجآءَ بِالنَّهارِ مُبْصِراً بِرَحْمَتِهِ، وَكَسانِي ضِيآءَهُ وَآتانِي نِعْمَتَهُ. أَللَّهُمَّ فَكَما أَبْقَيْتَنِي لَهُ فَأَبْقِنِي لاَِمْثالِهِ، وَصَلِّ عَلَى النَّبِيِّ مُحَمَّد وَآلِهِ، وَلا تَفْجَعْنِي فِيهِ وَفِي غَيْرِهِ مِنَ اللَّيالِي وَالاَيَّامِ بِارْتِكابِ الْمَحارِمِ، وَاكْتِسابِ الْمَاثِمِ، وَارْزُقْنِي خَيْرَهُ، وَخَيْرَ ما فِيهِ، وَخَيْرَ ما بَعْدَهُ، وَاصْرِفْ عَنِّي شَرَّهُ، وَشَرَّ ما فِيهِ، وَشَرَّ ما بَعْدَهُ.أَللَّهُمَّ إنِّي بِذِمَّةِ الاِسْلامِ أَتَوَسَّلُ إلَيْكَ، وَبِحُرْمَةِ الْقُرْآنِ أَعْتَمِدُ عَلَيْكَ، وَبِمُحَمَّد الْمُصْطَفى صَلَّى اللَّهُ عَلَيْهِ وآلِهِ أَسْتَشْفِعُ لَدَيْكَ، فَاعْرِفِ اللَّهُمَّ ذِمَّتِي الَّتِي رَجَوْتُ بِها قَضآءَ حاجَتِي، يا أَرْحَمَ الرَّاحِمِينَ.أَللَّهُمَّ اقْضِ لِي فِي الخَمِيسِ خَمْساً لا يَتَّسِعُ لَها إلاَّ كَرَمُكَ وَلا يُطِيقُها إلاَّ نِعَمُكَ: سَلامَةً أَقْوى بِها عَلَى طاعَتِكَ وَعِبادَةً أَسْتَحِقُّ بِها جَزِيلَ مَثُوبَتِكَ، وَسَعَةً فِي الْحالِ مِنَ الرِّزْقِ الْحَلالِ، وَأَنْ تُؤْمِنَنِي فِي مَواقِفِ الْخَوْفِ بِأَمْنِكَ، وَتَجْعَلَنِي مِنْ طَوارِقِ الْهُمُومِ وَالْغُمُومِ فِي حِصْنِكَ، صَلِّ عَلى مُحَمَّد وَآلِهِ، وَاجْعَل تَوَسُّلِي بِهِ شافِعَاً يَوْمَ الْقِيامَةِ نافِعاً، إنَّكَ أَنْتَ أَرْحَمُ الرَّاحِمِينَ.
    `
  }
   else if(dgr == 5){
    DuaRubrik.innerText = `${veckodagar[dgr]} dua'a `

    DuaSpan.innerText = `أَلْحَمْدُ لِلّهِ الاَوَّلِ قَبْلَ الانْشآءِ وَالاحْيآءِ، وَالاخِرِ بَعْدَ فَنآءِ الاَشْيَآءِ، الْعَلِيمِ الَّذِي لا يَنْسَى مَنْ ذَكَرَهُ، وَلا يَنْقُصُ مَنْ شَكَرَه، وَلا يُخَيِّبُ مَنْ دَعاهُ، وَلا يَقْطَعُ رَجآءَ مَنْ رَجاهُ.أَللَّهُمَّ إنِّي أُشْهِدُكَ وَكَفى بِكَ شَهِيداً، وَأُشْهِدُ جَمِيعَ مَلائِكَتِكَ، وَسُكَّانَ سَمواتِكَ، وَحَمَلَةَ عَرْشِكَ، وَمَنْ بَعَثْتَ مِنْ أَنْبِيآئِكَ وَرُسُلِكَ وَأَنْشَأْتَ مِنْ أَصْنافِ خَلْقِكَ، أَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لا إلهَ إلاَّ أَنْتَ، وَحْدَكَ لاَ شَرِيكَ لَكَ، وَلا عَدِيلَ وَلا خُلْفَ لِقَوْلِكَ وَلا تَبْدِيْلَ، وَأَنَّ مُحَمَّداً صَلَّى اللَّهُ عَلَيْهِ وآلِهِ عَبْدُكَ وَرَسُولُكَ، أَدَّى ما حَمَّلْتَهُ إلَى الْعِبادِ، وَجاهَدَ فِي اللَّهِ حَقَّ الْجِهادِ، وَأَنَّهُ بَشَّرَ بِما هُوَ حَقٌّ مِنَ الثَّوابِ، وَأَنْذَرَ بِما هُوَ صِدْقٌ مِنَ الْعِقابِ.أَللَّهُمَّ ثَبِّتْنِي عَلى دِينِكَ ما أَحْيَيْتَنِي، وَلا تُزِغْ قَلْبِي بَعْدَ إذْ هَدَيْتَنِي، وَهَبْ لِي مِنْ لَدُنْكَ رَحْمَةً، إنَّكَ أَنْتَ الْوَهَّابُ، صَلِّ عَلَى مُحَمَّد وَآلِ مُحَمَّد وَاجْعَلْنِي مِنْ أَتْباعِهِ وَشِيعَتِهِ وَاحْشُرْنِي فِي زُمْرَتِهِ وَوَفِّقْنِي لاَداءِ فَرْضِ الْجُمُعاتِ، وَما أَوْجَبْتَ عَلَيَّ فِيها مِنَ الطَّاعاتِ، وَقَسَمْتَ لاَِهْلِها مِنَ الْعَطآءِ فِي يَوْمِ الْجَزآءِ، إنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ.
    `
  }
   else if(dgr == 5){
    DuaRubrik.innerText = `${veckodagar[dgr]} dua'a `

    DuaSpan.innerText = `بِسْمِ الِلّهِ كَلِمَةِ الْمُعْتَصِمِينَ، وَمَقالَةِ الْمُتَحَرِّزِينَ، وَأَعُوذُ بِالِلّه تَعالى مِنْ جَوْرِ الْجآئِرِينَ، وَكَيْدِ الْحاسِدِينَ، وَبَغْيِ الظَّالِمِينَ، وَأَحْمَدُهُ فَوْقَ حَمْدِ الْحامِدِينَ.أَللَّهُمَّ أَنْتَ الْواحِدُ بِلا شَرِيك، وَالْمَلِكُ بِلا تَمْلِيك، لا تُضَادُّ فِي حُكْمِكَ، وَلا تُنازَعُ فِي مُلْكِكَ.أَسْأَلُكَ أَنْ تُصَلِّىَ عَلَى مُحَمَّد وَآلِهِ، عَبْدِكَ وَرَسُولِكَ، وَأَنْ تُوزِعَنِي مِنْ شُكْرِ نُعْماكَ ما تَبْلُغُ بِي غايَةَ رِضاكَ، وَأَنْ تُعِينَنِي عَلى طاعَتِكَ، وَلُزُومِ عِبادَتِكَ، وَاسْتِحْقاقِ مَثُوبَتِكَ بِلُطْفِ عِنايَتِكَ، وَتَرْحَمَنِي، وَتَصُدَّنِي عَنْ مَعَاصِيكَ مَا أَحْيَيْتَنِي، وَتُوَفِّقَنِي لِما يَنْفَعُنِي ما أَبْقَيْتَنِي، وَأَنْ تَشْرَحَ بِكِتابِكَ صَدْرِي، وَتَحُطَّ بِتِلاوَتِهِ وِزْرِي، وَتَمْنَحَنِي السَّلامَةَ فِي دِينِي وَنَفْسِي، وَلا تُوحِشَ بِي أَهْلَ أُنْسِي، وَتُتِمَّ إحْسَانَكَ فِيما بَقِيَ مِنْ عُمُرِي كَما أَحْسَنْتَ فِيما مَضَى مِنْهُ يا أَرْحَمَ الرَّاحِمِينَ.
    `
  }
   else if(dgr == 0){
    DuaRubrik.innerText = `${veckodagar[dgr]} dua'a `

    DuaSpan.innerText = `1 ـ بِسْمِ اللهِ الَّذِي لاَ أَرْجُو إِلاَّ فَضْلَهُ، وَلاَ أَخْشَى إلاَّ عَدْلَهُ، وَلا أَعْتَمِدُ إلاَّ قَوْلَهُ، وَلا أَتَمَسَّكُ إلاَّ بِحَبْلِهِ. 2 ـ بِكَ أَسْتَجِيرُ يا ذَا الْعَفْوِ وَالرِّضْوانِ مِنَ الظُّلْمِ وَالْعُدْوانِ، وَمِنْ غِيَرِ الزَّمانِ، وَتَواتُرِ الاَحْزانِ، وَمِنْ طَوارِقِ الْحَدَثَانِ، وَمِنِ انْقِضآءِ الْمُدَّةِ قَبْلَ التَّأَهُّبِ وَالْعُدَّةِ. 3 ـ وَإيَّاكَ أَسْتَرْشِدُ لِما فِيهِ الصَّلاحُ وَالاِصْلاحُ. 4 ـ وَبِكَ أَسْتَعِينُ فِيما يَقْتَرِنُ بِهِ النَّجاحُ وَالاِنْجاحُ.5 ـ وَإيَّاكَ أَرْغَبُ فِي لِباسِ الْعافِيَةِ وَتَمامِها، وَشُمُولِ السَّلامَةِ وَدَوامِها، وَأَعُوذُ بِكَ يارَبِّ مِنْ هَمَزاتِ الشَّياطِينِ، وَأَحْتَرِزُ بِسُلْطانِكَ مِنْ جَوْرِ السَّلاطِينِ، فَتَقَبَّلْ ما كانَ مِنْ صَلاتِي وَصَوْمِي، واجْعَلْ غدي وَمَا بَعْدَهُ أفَضَلَ من سَاعَتي وَيَوْمِي، وَأَعِزَّنِي فِي عَشِيرَتِي وَقَوْمِي، وَاحْفَظْنِي فِي يَقْظَتِي وَنَوْمِي، فَأَنْتَ اللَّهُ خَيْرٌ حافِظاً، وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ.6 ـ أَللَّهُمَّ إنِّي أَبْرَأُ إلَيْكَ فِي يَوْمِي هذا وَ ما بَعْدَهُ مِنَ الاحادِ مِنَ الشِّرْكَ وَالالْحَادِ، وَأُخْلِصُ لَكَ دُعآئِي تَعَرُّضَاً لِلاِجابَةِ واُقيم على طاعتِكَ رجاءً للأِثابَةِ . 7 ـ فَصَلِّ عَلَى مُحَمَّد وَآلِ مُحَمَّد خَيْرِ خَلْقِكَ، الدَّاعِي إلَى حَقِّكَ، وَأَعِزَّنِي بِعِزِّكَ الَّذِي لا يُضامُ، وَاحْفَظْنِي بِعَيْنِك الَّتِي لاتَنامُ، وَاخْتِمْ بِالانْقِطَاعِ إلَيْكَ أَمْرِي، وَبِالْمَغْفِرَةِ عُمْرِي، إنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ.
    `
  }







